'''Дан список целых чисел. Подсчитать сколько четных чисел в списке'''

print('1 вариант')
a = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 13, 15, 16]
even = 0
for i in range (len(a)):
    if a[i] % 2 == 0:
        even += 1
print(even)

print('2 вариант')
a = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 13, 15, 16]
even = 0
i = 0
while i <= (len(a) - 1):
    if a[i] % 2 == 0:
        even += 1
    i +=1
print(even)